In [2]:
import mysql.connector

mydp = mysql.connector.connect(
    host="localhost",
    username="username",
    password = "password"
)

print(mydp)

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000025C43D4CAD0>

In [4]:
mycursor = mydp.cursor()
mycursor.execute("SHOW DATABASES")

for x in mycursor:
    print(x)

('information_schema',)
('mydatabase',)
('mysql',)
('performance_schema',)
('sys',)
('tables1',)

In [5]:
mycursor.execute("CREATE DATABASE  working")

In [6]:
mycursor.execute("SHOW DATABASES")

for i in mycursor:
    print(i)

('information_schema',)
('mydatabase',)
('mysql',)
('performance_schema',)
('sys',)
('tables1',)
('working',)

In [5]:
mydb = mysql.connector.connect(
    host="localhost",
    username="username",
    password = "password",
    database = "working"
)

mynew = mydb.cursor()

In [ ]:

mynew.execute("CREATE TABLE customers (name VARCHAR(255), address VARCHAR(255))")

In [ ]:
sql = "INSERT INTO customers (name, address) VALUES (%s, %s)"
value = ("Awwal", "Ipaja, Lagos")
mynew.execute(sql,value)
mydb.commit()

In [11]:
print(mynew.rowcount, "was inserted")

1 was inserted

In [12]:
new = "INSERT INTO customers (name, address) VALUES (%s, %s)"
old = [
  ('Peter', 'Lowstreet 4'),
  ('Amy', 'Apple st 652'),
  ('Hannah', 'Mountain 21'),
  ('Michael', 'Valley 345'),
  ('Sandy', 'Ocean blvd 2'),
  ('Betty', 'Green Grass 1'),
  ('Richard', 'Sky st 331'),
  ('Susan', 'One way 98'),
  ('Vicky', 'Yellow Garden 2'),
  ('Ben', 'Park Lane 38'),
  ('William', 'Central st 954'),
  ('Chuck', 'Main Road 989'),
  ('Viola', 'Sideway 1633')
]

mynew.executemany(new, old)
mydb.commit()
print(mynew.rowcount, "was inserted")

13 was inserted

In [13]:
mynew.execute("SELECT * FROM customers")

myresult = mynew.fetchall()

for t in myresult:
    print(t)

('Awwal', 'Ipaja, Lagos')
('Awwal', 'Ipaja, Lagos')
('Peter', 'Lowstreet 4')
('Amy', 'Apple st 652')
('Hannah', 'Mountain 21')
('Michael', 'Valley 345')
('Sandy', 'Ocean blvd 2')
('Betty', 'Green Grass 1')
('Richard', 'Sky st 331')
('Susan', 'One way 98')
('Vicky', 'Yellow Garden 2')
('Ben', 'Park Lane 38')
('William', 'Central st 954')
('Chuck', 'Main Road 989')
('Viola', 'Sideway 1633')

In [20]:
mynew.execute("ALTER TABLE customers ADD COLUMN id INT AUTO_INCREMENT PRIMARY KEY")

In [6]:
query = "SELECT * FROM customers ORDER BY name"

mynew.execute(query)
myreult = mynew.fetchall()

for x in myreult:
    print(x)

('Amy', 'Apple st 652', 4)
('Awwal', 'Ipaja, Lagos', 1)
('Awwal', 'Ipaja, Lagos', 2)
('Ben', 'Park Lane 38', 12)
('Betty', 'Green Grass 1', 8)
('Chuck', 'Main Road 989', 14)
('Hannah', 'Mountain 21', 5)
('Michael', 'Valley 345', 6)
('Peter', 'Lowstreet 4', 3)
('Richard', 'Sky st 331', 9)
('Sandy', 'Ocean blvd 2', 7)
('Susan', 'One way 98', 10)
('Vicky', 'Yellow Garden 2', 11)
('Viola', 'Sideway 1633', 15)
('William', 'Central st 954', 13)

In [8]:
re = "SELECT * FROM customers ORDER BY name DESC"
mynew.execute(re)
mydesc = mynew.fetchall()

for y in mydesc:
    print(y)

('William', 'Central st 954', 13)
('Viola', 'Sideway 1633', 15)
('Vicky', 'Yellow Garden 2', 11)
('Susan', 'One way 98', 10)
('Sandy', 'Ocean blvd 2', 7)
('Richard', 'Sky st 331', 9)
('Peter', 'Lowstreet 4', 3)
('Michael', 'Valley 345', 6)
('Hannah', 'Mountain 21', 5)
('Chuck', 'Main Road 989', 14)
('Betty', 'Green Grass 1', 8)
('Ben', 'Park Lane 38', 12)
('Awwal', 'Ipaja, Lagos', 1)
('Awwal', 'Ipaja, Lagos', 2)
('Amy', 'Apple st 652', 4)

In [9]:
delete = "DELETE FROM customers WHERE name = 'Awwal'" 
mynew.execute(delete)
mydb.commit()
print(mynew.rowcount, "record(s) deleted")

2 record(s) deleted

In [10]:
code = "SELECT * FROM customers WHERE address LIKE '%way%'"

mynew.execute(code)
mycode = mynew.fetchall()

for i in mycode:
    print(i)

('Susan', 'One way 98', 10)
('Viola', 'Sideway 1633', 15)

In [11]:
why = "SELECT * FROM customers WHERE address LIKE '_e%'" 
mynew.execute(why)
mywhy = mynew.fetchall()

for w in mywhy:
    print(w)

('Vicky', 'Yellow Garden 2', 11)
('William', 'Central st 954', 13)

In [12]:
drop = "DROP TABLE people"
mynew.execute(drop)

In [13]:
update = "UPDATE customers SET address = 'All way 134' WHERE address LIKE '%way%'"

mynew.execute(update)
mydb.commit()

print(mynew.rowcount, "record(s) affected")

2 record(s) affected

In [14]:
limit = "SELECT * FROM customers LIMIT 5"
mynew.execute(limit)
mylimit = mynew.fetchall()

for y in mylimit:
    print(y)

('Peter', 'Lowstreet 4', 3)
('Amy', 'Apple st 652', 4)
('Hannah', 'Mountain 21', 5)
('Michael', 'Valley 345', 6)
('Sandy', 'Ocean blvd 2', 7)

In [16]:
limit_off = "SELECT * FROM customers LIMIT 10 OFFSET 2"
mynew.execute(limit_off)
mylimit_off = mynew.fetchall()

for x in mylimit_off:
    print(x)

('Hannah', 'Mountain 21', 5)
('Michael', 'Valley 345', 6)
('Sandy', 'Ocean blvd 2', 7)
('Betty', 'Green Grass 1', 8)
('Richard', 'Sky st 331', 9)
('Susan', 'All way 134', 10)
('Vicky', 'Yellow Garden 2', 11)
('Ben', 'Park Lane 38', 12)
('William', 'Central st 954', 13)
('Chuck', 'Main Road 989', 14)

In [ ]:
table = "CREATE TABLE worked (id INT AUTO_INCREMENT PRIMARY KEY, surname VARCHAR (255), position VARCHAR (255))"
mynew.execute(table)

In [21]:
insert = "INSERT INTO worked (surname, position) VALUES (%s, %s)"
val = [
    ("Adebayo", "MD"),
    ("Abdulhammed", "senior Manager"),
    ("Abubakar", "clerk"),
    ("Garuba", "Head Manager")
]
mynew.executemany(insert, val)
mydb.commit()

In [22]:
join = "SELECT c.name, w.surname FROM customers AS c INNER JOIN worked AS w ON c.id = w.id"

mynew.execute(join)
myjoin = mynew.fetchall()

for t in myjoin:
    print(t)

('Peter', 'Abubakar')
('Amy', 'Garuba')